/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   check_map.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ejang <ejang@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/08/23 16:25:47 by ejang             #+#    #+#             */
/*   Updated: 2022/08/23 16:31:48 by ejang            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../inc/cub3d.h"

void	check_map(t_cub *cub)
{
	//유효성 확인 끝
	cub->map->f_color = ft_cal_color(cub->map->f);
	cub->map->c_color = ft_cal_color(cub->map->c);
}
